[
    {
      "heading": "Machine Learning Workshop",
      "content": "The AI/ML Workshop provides a comprehensive introduction to Machine Learning (ML) and Deep Learning (DL), combining theoretical foundations with practical, hands-on experience. Key topics include neural networks, model training, and evaluation techniques. Participants will engage in a project-based learning session, where they will develop, train, and deploy ML models to address real-world challenges. This interactive approach ensures a deep understanding of AI/ML principles while equipping participants with the skills to independently apply these techniques in various domains.",
      "shortcontent":"The AI/ML Workshop provides a comprehensive introduction to Machine Learning (ML) and Deep Learning (DL), combining theoretical foundations with practical, hands-on experience.",
      "image": "/Images/Events/devhack-for-site.png",
      "registrationLink": "",
      "location": "PC IIT Dharwad",
      "timing": "31 Jan, 2:00 PM - 1 Feb, 10:00 PM"
    },
    {
      "heading": "Aeromodelling Workshop",
      "content": "The Aero-Modelling Workshop will be conducted by an external expert with extensive experience in aerodynamics and model aircraft design. This hands-on session will provide participants with the opportunity to build, test, and analyse model aircraft while gaining a deeper understanding of flight mechanics, control surfaces, and propulsion systems. Through interactive guidance, the expert will bridge theoretical concepts with real-world applications, ensuring a comprehensive learning experience. This workshop aims to foster curiosity, enhance technical skills, and provide participants with a strong foundation in aerospace principles.",
      "shortcontent":"The Aero-Modelling Workshop will be conducted by an external expert with extensive experience in aerodynamics and model aircraft design.",
      "image": "/Images/Events/algostrike-for-site.png",
      "registrationLink": "",
      "location": "PC IIT Dharwad",
      "timing": "1 Feb, 2:00 PM - 4:00 PM"
    },
    {
      "heading": "Design Workshop",
      "content": "Design Workshop",
      "shortcontent":"Design Workshop",
      "image": "/Images/Events/build-a-bot-for-site.png",
      "registrationLink": "",
      "location": "PC IIT Dharwad",
      "timing": "31 Jan, 12:00 PM - 1 Feb, 12:00 PM"
    },
    {
      "heading": "DevOps Workshop",
      "content": "The DevOps Workshop offers an intermediate-level understanding of DevOps principles, focusing on seamless integration between development and operations for efficient software deployment. Participants will explore CI/CD pipelines, containerization with Docker, infrastructure as code, and monitoring tools. Hands-on sessions will provide practical experience in automating workflows, improving system reliability, and streamlining deployment processes.",
      "shortcontent":"The DevOps Workshop offers an intermediate-level understanding of DevOps principles, focusing on seamless integration between development and operations for efficient software deployment.",
      "image": "/Images/Events/bithunt-for-site.png",
      "registrationLink": "",
      "location": "PC IIT Dharwad",
      "timing": "1 Feb, 9:00 AM - 3:00 PM"
    }
  ]  